Revit 2026 API

# TrussCurveType Enumeration

---

Types of curves created in truss families.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TrussCurveType
```
```vb
Public Enumeration TrussCurveType
```
```cpp
public enum class TrussCurveType
```
```fsharp
type TrussCurveType
```

| Member name | Value | Description |
| --- | --- | --- |
| BottomChord | 2 |  |
| NonTrussCurve | 0 |  |
| TopChord | 1 |  |
| Web | 3 |  |

#### Reference

Autodesk.Revit.DB.Structure Namespace